In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats

import datetime

import matplotlib.pyplot as plt
%matplotlib inline

plt.style.use('ggplot')

In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
df_nyse = pd.read_csv('nyse.csv')

In [4]:
df_nyse.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5131 entries, 0 to 5130
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       5131 non-null   object
 1   Open       5131 non-null   float64
 2   High       5131 non-null   float64
 3   Low        5131 non-null   float64
 4   Close      5131 non-null   float64
 5   Adj Close  5131 non-null   float64
 6   Volume     5131 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 280.7+ KB

In [5]:
df_nyse.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,6762.109863,6762.109863,6762.109863,6762.109863,6762.109863,0
1,2000-01-04,6543.759766,6543.759766,6543.759766,6543.759766,6543.759766,0
2,2000-01-05,6567.029785,6567.029785,6567.029785,6567.029785,6567.029785,0
3,2000-01-06,6635.439941,6635.439941,6635.439941,6635.439941,6635.439941,0
4,2000-01-07,6792.669922,6792.669922,6792.669922,6792.669922,6792.669922,0

In [6]:
df_nyse = df_nyse[['Date','Close']]

In [7]:
df_nyse.rename(columns = {'Date':'date', 'Close':'nyse_close'}, inplace = True)

In [8]:
df_nyse['date'] = pd.to_datetime(df_nyse['date'], yearfirst = True)

In [9]:
df_nyse.sort_values(by = 'date', inplace = True)

In [10]:
df_nyse['nyse_close_lag1'] = df_nyse['nyse_close'].shift(1)

In [11]:
df_nyse['nyse_change%'] = 100*((df_nyse['nyse_close'] - df_nyse['nyse_close_lag1']) / df_nyse['nyse_close_lag1'])
df_nyse['nyse_dif'] = df_nyse['nyse_close'] - df_nyse['nyse_close_lag1']

In [12]:
df_nyse.head()

        date   nyse_close  nyse_close_lag1  nyse_change%    nyse_dif
0 2000-01-03  6762.109863              NaN           NaN         NaN
1 2000-01-04  6543.759766      6762.109863     -3.229023 -218.350097
2 2000-01-05  6567.029785      6543.759766      0.355606   23.270019
3 2000-01-06  6635.439941      6567.029785      1.041721   68.410156
4 2000-01-07  6792.669922      6635.439941      2.369549  157.229981

In [13]:
%store df_nyse

Stored 'df_nyse' (DataFrame)